erik-elemind/monorepo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EEG_RESETn_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EEG_RESETn_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_EEG_RESETn_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EEG_RESETn_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EEG_RESETn_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO2_7 (coord U16), EEG_LDO_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_EEG_LDO_EN_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITPINS_EEG_LDO_EN_SIGNAL PIO2              /*!<@brief Signal name */
#define BOARD_INITPINS_EEG_LDO_EN_CHANNEL 7                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EEG_LDO_EN_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EEG_LDO_EN_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_EEG_LDO_EN_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EEG_LDO_EN_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EEG_LDO_EN_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_12 (coord E3), LEDB_PWM
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LEDB_PWM_PERIPHERAL GPIO                   /*!<@brief Peripheral name */
#define BOARD_INITPINS_LEDB_PWM_SIGNAL PIO0                       /*!<@brief Signal name */
#define BOARD_INITPINS_LEDB_PWM_CHANNEL 12                        /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDB_PWM_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDB_PWM_GPIO_PIN_MASK (1U << 12U)         /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDB_PWM_PORT 0U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LEDB_PWM_PIN 12U                           /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDB_PWM_PIN_MASK (1U << 12U)              /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO0_26 (coord A2), LEDG_PWM
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LEDG_PWM_PERIPHERAL GPIO                   /*!<@brief Peripheral name */
#define BOARD_INITPINS_LEDG_PWM_SIGNAL PIO0                       /*!<@brief Signal name */
#define BOARD_INITPINS_LEDG_PWM_CHANNEL 26                        /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDG_PWM_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDG_PWM_GPIO_PIN_MASK (1U << 26U)         /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDG_PWM_PORT 0U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LEDG_PWM_PIN 26U                           /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDG_PWM_PIN_MASK (1U << 26U)              /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO0_27 (coord B3), LEDR_PWM
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LEDR_PWM_PERIPHERAL GPIO                   /*!<@brief Peripheral name */
#define BOARD_INITPINS_LEDR_PWM_SIGNAL PIO0                       /*!<@brief Signal name */
#define BOARD_INITPINS_LEDR_PWM_CHANNEL 27                        /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDR_PWM_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDR_PWM_GPIO_PIN_MASK (1U << 27U)         /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDR_PWM_PORT 0U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LEDR_PWM_PIN 27U                           /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDR_PWM_PIN_MASK (1U << 27U)              /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
